// import 'package:flutter/material.dart';
import '../models/snake_model.dart';

final List<Snake> snakeData = [
  Snake(
    name: 'පළා පොළඟා (Sri Lankan Green Pit Viper)',
    venomLevel: 'මද විෂ (Mildly Venomous)',
    imagePath: 'assets/images/snakes/green_pit_viper.jpg',
    identification:
        'ශ්‍රී ලංකාවේ හමුවන එකම රුක්වාසී පොළොන් විශේෂය වන අතර ලංකාවට ආවේණික සර්ප විශේෂයක් වේ.  ශරීර වර්ණය තනි කොළ මෙන්ම කහ මිශ්‍ර කොළ පැහැයේ සිට නිල් මිශ්‍ර කොළ පැහැය අතර වර්ණ පරාසයකින් හමුවේ. ශරීරයේ මතුපිට කළු පැහැති අක්‍රමවත් පුල්ලි රටාවක් දැකගත හැක. ගෙලින් පැහැදිලිව වෙන්වූ ත්‍රිකෝණාකාර හිසක් දැකගත හැක. ශ්‍රී ලංකාවේ ඉහළ කඳුකරය හා ශුෂ්ක කලාප හැරුණකොට වියළි කලාපයේ සිට මධ්‍යම කඳුකරය, පහත රට තෙත් කලාපය වැනි ප්‍රදේශ වල ව්‍යාප්ත වී සිටී. පරිසරයට අනුවර්ථනය වීම සඳහා වියළි කලාපයේ දී වර්ණයෙන් තරමක් ලා පැහැ වන අතර තෙත් කලාපයේ දී තද දීප්තිමත් කොළ පැහැයක් ගනී.ගලා යන ජල මූලාශ්‍ර අවට පිහිටි ශාක මත ගැවසීමට වඩා ප්‍රියතාවක් දක්වයි. කෝපි, කොකෝවා හා එනසාල් වගා බිම් වැනි ස්ථාන වලින් සුලභව හමුවේ.',
    venomEffect:
        'මද විෂ කාණ්ඩයේ සර්පයෙක් වන අතර දෂ්ටන වාර්තා වී තිබුනද කිසිදු මරණයක් වාර්තා වී නොමැත. නමුත් දෂ්ටනයක් වුවහොත් වකුගඩු අකර්මන්‍ය වීම් හා වසා පද්ධතිය ආශ්‍රිත සංකුලතා වලට ලක්වීමට ඇති හැකියාව නිසා ‍රෝහල් ගත කිරීම අත්‍යාවශ්‍ය වේ.',
    activeTime:
        'ප්‍රධාන වශයෙන් නිසාචර සර්ප විශේෂයක් වේ. දහවල් කාලයේ අතු පතර අලසව රැදී සිටී.',
  ),
  Snake(
    name: 'නයා (Indian Cobra)',
    venomLevel: 'උග්‍ර විෂ (Highly Venomous)',
    imagePath: 'assets/images/snakes/cobra.JPG',
    identification:
        'කළු පැහැයේ සිට දුඹුරු හා  අළු පැහැයට ඇති වර්ණ වලින් දක්නට ලැබේ. ශරීරයේ හරස් අතට කුඩා කඩ ඉරි වැනි රේඛා දක්නට ලැබෙන අතර ඉලිප්සාකාර කොරල රටාවක් පවතී. උදරීය පැහැය බොහෝ විට ක්‍රීම් හා සුදු පැහැයක් ගනී. හිසට තරමක් පිටුපසින් පෘෂ්ඨීයව සිංහල අක්ෂර මාලාවේ "ප" අකුරේ හැඩති සලකුණක් දක්නට ඇත. භෞමික විශේෂයක් වුවද කුඩා පඳුරු හා මද උස ගස් වල සංචරණය ද දක්නට ලැබේ. බිත්ති කුහර, ලී කොටන්, පස් තුල ඇති ගුල් හා තුඹස් වැනි ස්ථානයන් වල කාලය ගත කිරීමට කැමැත්තක් දක්වයි. මුහුදු මට්ටමේ සිට 1200m පමණ වන තෙක් ඇති සියලු පරිසර පද්ධතිවල හා වගා බිම් ඇතුළු ජල මූලාශ්‍ර අවට පරිසරයන් වල දැකගත හැක. තර්ජනයක් දැනුන විට පලා යෑමට උත්සාහ කරන අතර එය අසාර්ථක වූ විට ශරීරයේ පෙර කොටස ඉහලට ඔසවා පෙනය කර තදින් පිම්බීමක් සිදු කරයි.',
    venomEffect:
        'ස්නායු පද්ධතිය අඩපණ වීම සිදුවන අතර ඇසිපිය කඩා වැටීම, මාංශපේශි පාලනය කිරීම හා හුස්ම ගැනීම අපහසු වීම සිදු වේ. දැඩි වේදනාවක් සහ දෂ්ටකල ස්ථානයේ ඉදිමුම හා පටක කුණුවීම සිදුවිය හැක.',
    activeTime:
        'දහවල් හා ‍රාත්‍රී කාලයන් දෙකෙහිම ක්‍රියාකාරී සර්ප කාණ්ඩයක් වේ.',
  ),
  Snake(
    name: 'තිත් පොළඟා (Russell\'s Viper)',
    venomLevel: 'උග්‍ර විෂ (Highly Venomous)',
    imagePath: 'assets/images/snakes/russells_viper.jpg',
    identification:
        'ශරීරය ලා කහ පැහැයේ සිට දුඹුරු පැහැය තෙක් ඇති වර්ණ පරාසයකින් දක්නට ලැබෙන අතර උදරීය පැහැය සුදු හෝ කහ මිශ්‍ර සුදු වේ. ශරීරය පුරාවටම දිගු අතට පිහිටා ඇති දුඹුරු පැහැති පුල්ලි පෙළක් සහිත කොරල වලින් වැසී ඇති රළු ප්‍රෂ්ඨිමත් දේහයකට හිමිකම් කියයි. ඇතැම් සතුන්ගේ මෙම පුල්ලි එකිනෙක යාවී දම්වැලක හැඩයක් ගන්නා අතර පැහැදිලිව පුල්ලි වෙන්ව ඇති සතුන්ද ඇත. පුල්ලි මායිම් වන කළු පැහැති වට දාරයත්, තවත් සිහින් සුදු පැහැති වට දාරයකුත් පිහිටීම නිසා උග්‍ර විෂ කාණ්ඩයේ අලංකාර සර්පයෙක් ලෙස සැලකේ. ගෙලින් පැහැදිලිව වෙන්වූ ත්‍රිකෝණාකාර පැතලි හිසක් පිහිටා ඇත. ප්‍රෂ්ඨීයව හිසේ පෙර දෙසට වන්නට තුඩ පිහිටි ඉංග්‍රීසි "V" අකුරේ හැඩය ඇති සුදු පැහැ සලකුණක් පිහිටා ඇත. භෞමික සර්පයෙක් වුවද කෙටි උසකින් යුත් ශාක හා පඳුරු වලට නැගීමේ හැකියාවක් ඇත. තම දේහ වර්ණ පරිසරයත් සමග අනුවර්තනය කර ගැනීමට ඇති හැකියාව නිසා වියලි දිරාපත්වන කොළ රොඩු අතර සැගව සිටීමට හා කෘෂිකාර්මික භූමි වල බොහෝවිට දක්නට ලැබෙන සර්ප විශේෂයක් වේ. ඉතා ඉක්මනින් කලබලකාරී වන අතර තමාට තර්ජනයක් දැනුන විගස පලා යෑමට තැත් කරයි. එසේ කිරීමට නොහැකි වූ විට ශරීරය දරනයක් ගසා ඉතා උස් හඬින් පිඹීමක් සිදු කර අනතුරු හඟවයි. ඉතා ශීත කාලගුණයක් ඇති ඉහල කඳුකරයේ හැරුනුකොට මුහුදු මට්ටමේ සිට 1500m තෙක් වූ මධ්‍යම කඳුකරය දක්වා ඇති සියලු දේශගුණික කලාප වල දක්නට ලැබේ.',
    venomEffect:
        'විෂ ප්‍රධාන වශයෙන් රුධිර සංසරණ පද්ධතියට හානි කරන අතර, ස්නායු හා වකුගඩු වලටද හානි සිදු කල හැක. තුවාලයෙන් අධික රුධිර වහනයත්, දිය පට්ටා දමා ඉදිමීමත් සිදු විය හැක. විෂ රුධිර සංසරණ පද්ධතියට හානි කරන බැවින් අභ්‍යන්තර රුධිර වහනය, ඇස, නාසය, විදුරුමස්, ලිංගික ඉන්ද්‍රියන් වලින් රුධිර වහනය, හා වමනය සමග රුධිරය පිටවීම සිදු විය හැක. දෂ්ටනයකින් පසු නිසි වෛද්‍ය ප්‍රතිකාර නොකළහොත් දීර්ඝ කාලීන බලපෑම් සිදුවිය හැක.',
    activeTime: 'ප්‍රධාන වශයෙන් නිසාචර සර්ප විශේෂයක් වේ.',
  ),
  Snake(
    name: 'තෙල් කරවලා (Common Krait)',
    venomLevel: 'උග්‍ර විෂ (Highly Venomous)',
    imagePath: 'assets/images/snakes/krait.jpg',
    identification:
        'ශ්‍රී ලංකාවේ ජීවත්වන භෞමික සර්පයන් අතරින් උග්‍රම විෂ සහිත සර්පයා ලෙස සලකන අතර ඇතැම් ප්‍රදේශවල මඟ මරුවා යනුවෙන් මේ විශේෂය හැදින්වීමටත් එය හේතුවක් වේ. සිලින්ඩරාකාර සිරුරක් හා පැහැදිලිව ගෙලෙන් වෙන් නොවූ හිසක් ඇත. ශරීරය සුමට කොරල වලින් වැසී ඇති අතර දිදුළන ස්වරූපයක් ගනී. ශරීර වර්ණය ප්‍රධාන වශයෙන් කළු පැහැයක් ගනී. ශරීරයේ හරස් අතට සුදු පැහැ වළලු මෙන් තුනී තීරු යුගල් වශයෙන් වෙන්ව පිහිටා ඇත. කොදු නාරටිය මත ඇති කොරල වඩා විශාල වන අතර ෂඩාශ්‍රාකාර හැඩයක් ගනී. සුදු පැහැති තීරු යුගල් හා ෂඩාශ්‍රාකාර කොරල පේළිය මෙම විශේෂය හදුනා ගැනීමට ඇති ප්‍රධාන සාධකය වේ. කුඩා පැටවුන්ගේ ඉහත සඳහන් සුදු තීරු ඉතා දීප්තිමත්ව සම්පුර්ණව පිහිටා තිබුනත් වයසට යෑමත් සමග ඒවා නැතිවී යයි. දිවා කාලයේදී පොළව ඇතුලත පිහිටි ගුල්, දිරා යන ලී කොටන් හා ගල් කුහර වැනි අඳුරු සිසිල් ස්ථාන වල කාලය ගත කරන මොවුන් රාත්‍රී කාලය එළඹීමත් සමග ඉතා ක්‍රියාශීලී වේ. දිවයිනේ පහත රට වියළි කලාපයේ හා ශුෂ්ක කලාපවල බහුලවත් අතරමැද කලාපයේ අවම වශයෙනුත් තෙල් කරවැලුන් ව්‍යාප්ත වී සිටී.',
    venomEffect:
        'ප්‍රධාන වශයෙන් ස්නායුක විෂ වලින් සමන්විත වේ. කෙටි විෂ දල යුගලක් පිහිටීම නිසා දෂ්ට කිරීමේදී වේදනාව අවම වේ. විෂ මගින් මාංශ පේශි අතර සම්බන්දය බිඳ දමන අතර හුස්ම ගැනීම අපහසු කරවයි.',
    activeTime: 'නිසාචර සර්ප විශේෂයක් වේ.',
  ),
  Snake(
    name: 'කුණකටුවා/පොළොං තෙලිස්සා (Hump-nosed Pit Viper)',
    venomLevel: 'උග්‍ර විෂ (Highly Venomous)',
    imagePath: 'assets/images/snakes/humpnosed_pit_viper.jpg',
    identification:
        'පොළොන් තෙලිස්සන් විශාල වර්ණ පරාසයකින් හමුවේ. දුඹුරු, තැඹිලි, අළු වර්ණ වල ලා පැහැයන් සිට තද පැහැයන් වලට විහිදුන වර්ණ බොහොමයකින් මෙම සර්ප විශේෂය හමුවීම විශේෂත්වයකි. කලු/දුඹුරු පැහැති ත්‍රිකෝණාකාර පුල්ලි 20-35ක් පමණ සංක්‍යාවක් එම රේඛාව දෙපස එකිනෙකට මුහුණලා එකිනෙක ස්පර්ෂ වන ලෙස හෝ සිග්සැග් ආකාරයෙන් පිහිටයි. ඉතා ඉහල කඳුකරයේ හැරුණකොට මෝසම්, තෙත් සදාහරිත ඇතුළු සියලු පරිසර පද්ධති හා ගෙවතු ආශ්‍රිතව ව්‍යාප්ත වී ඇත. උපතෙදී පැටවුන් දිගින් 14cm පමණ වන අතර සාමාන්‍යයෙන් වැඩුණු සතෙක් 30cm පමණ වේ. කලාතුරකින් 50cm ආසන්න දිගින් යුතු සත්වයන්ද හමුවී ඇත.',
    venomEffect:
        'පොළොන් තෙලිස්සා ශ්‍රී ලංකාවේ සිදුවන විෂ ශරීරගතවීම් සහිත දෂ්ටන වැඩිම සංඛ්‍යාවක් සිදුකරන සර්ප විශේෂය වේ. ප්‍රධාන ලෙස වකුගඩු වලට හා පටක වලට හානි කරන අතර දෂ්ටනයකින් පසු ස්ථානීය රෝග ලක්ෂණ ලෙස අධික වේදනාව, දිය පට්ටා දැමීම හා ඉදිමීම දැකගත හැක. රෝගියා හැකි ඉක්මනින් රෝහල් ගත නොකළහොත් පටක කුණු වීම හා වකුගඩු අකර්මන්‍ය වීමටද ඉඩ ඇත.',
    activeTime: 'නිසාචර සර්ප විශේෂයක් වුවත් දහවල් කාලයේද දැකිය හැක.',
  ),
  Snake(
    name: 'මල් රදනකයා (Flowery Wolf Snake)',
    venomLevel: 'නිර්විෂ (Non-venomous)',
    imagePath: 'assets/images/snakes/wolf_snake.JPG',
    identification:
        'ගෘහාශ්‍රිතව බහුලව හමුවන නිර්විෂ සර්ප විශේෂයක් වේ. ශරීරයේ සුදු, ක්‍රීම්, හෝ කහ වර්ණයෙන් යුත් පුල්ලි දක්නට ලැබෙන අතර ඇතැම් විට මෙම පුල්ලි රටා නොමැතිවද දක්නට ලැබේ. දුඹුරු වර්ණ රටාවේ තද පැහැයේ සිට ලා පැහැයට ඇති වර්ණ පරාසවලින් දැකිය හැක. අමතරව අලු, රතු මිශ්‍ර දුඹුරු වැනි වර්ණ වලින්ද හමුවේ. පැහැදිලිව ගෙලෙන් වෙන් වී පෙනෙන හිස ඇති අතර පෙයාස් ගෙඩියක හැඩයක් ගනී. රළු සිරස් ප්‍රෂ්ඨ දිගේ ඉහලට ගමන් කිරීමට සුවිශේෂ හැකියාවක් ඇත. බොහෝ විට හූනන්, කැරපොත්තන් හා කෘමි සතුන් වැනි ගොදුරු සොයා මිනිස් වාසස්ථාන වලට නිතර ඇතුල් වන අතර මිනිසුන්ට කිසිදු මාරාන්තික හානියක් නොමැති සර්ප විශේෂයක් වේ. දහවල් කාලයේදී කුඩා බිත්ති කුහර, දිරා යන ලී කොටන් , නිවාස තුල ඇති මල් පෝච්චි, ලී මඩු වැනි ස්ථාන වල සැඟව සිටීමට උත්සහ කරයි. ඉතා පරීක්ෂාකාරී සර්ප විශේෂයක් වන අතර අනතුරක් දැනුන විගස දඟරයක් ගැසී හිස ඒ තුල සඟවා ආරක්ෂක ඉරියව්වකට ශරීරය සකසා ගනී. නිදහස් අතින් අල්ලාගත්විට සපා කෑමට පෙළඹෙන නමුත් ආක්‍රමණශීලී නොවන අහිංසක සර්ප විශේෂයක් වේ. දිවයින පුරා මුහුදු මට්ටමේ සිට 350m පමණ වන්නට වෙරළාසන්නව හා වියළි කලාපයේ ව්‍යාප්තව සිටී.',
    venomEffect:
        'කිසිදු විෂක් හෝ විෂ දළ පිහිටිමක් නොමැත. නමුත් සපා කෑමක් සිදු වුවහොත් ඉතා සුළු තුවාල සිදුවිය හැකි අතර වෛද්‍ය උපදෙස් මත අවශ්‍ය නම් පිටගැස්ම වැනි එන්නතක් ලබා ගැනීම සුදුසු වේ.',
    activeTime: 'සැන්දෑ හා රාත්‍රී කාලයේදී වඩා ක්‍රියාකාරී සර්ප කාණ්ඩයක් වේ.',
  ),
  Snake(
    name: 'අරණි දත්කැටියා (Common Kukri Snake)',
    venomLevel: 'නිර්විෂ (Non-venomous)',
    imagePath: 'assets/images/snakes/common_kukri_snake.jpg',
    identification:
        'ශ්‍රී ලංකාව තුළ සුලබවම හමුවන දත්කැටියන් විශේෂය වේ. හිස පැහැදිලිව ගෙලින් වෙන්වී නොමැත. ශරීරයේ ප්‍රධාන වර්ණයන්  දුඹුරු, කහ මිශ්‍ර දුඹුරු වැනි වර්ණ වන අතර ගොමකොළ වර්ණයෙන් හමුවන අවස්ථාද ඇත. පෘෂ්ඨීයව තද දුඹුරු හෝ කලු පැහැති හරස් පටි 10-25ක් පමණ සංඛ්‍යාවක් ගෙලෙහි සිට වල්ගය දක්වා පිහිටා ඇත. මෙම හරස්පටි ශරීරය දෙපසින් සිහින් වේ. අනෙක් දත්කැටි විශේෂ මෙන් අරණි දත්කැටියාගේත් හිසෙහි පෘෂ්ඨීයව ඇස් දෙක යා කෙරෙන රේඛාවක් ද හෝම්බුව දෙසට වන්නට තුඩ පිහිටන V අකුරේ හැඩයෙන් යුත් සලකුණු දෙකක් හෝ එකක් හිස මතුපිට හා හිසේ පිටිපසට වන්නට පිහිටා ඇත. පිටුපසින් ඇති සලකුණ ඝනකමින් හා විශාලත්වයෙන් වැඩිය. උදරීය පැහැය තනි සුදු වේ. අලුත උපන් කුඩා පැටවුන් දිගින් 10cmක් තරම්ද වැඩුනු සතෙකු 60cm ක් තරම් දිගකින් යුක්ත වේ.',
    venomEffect:
        'කිසිදු විෂක් නොමැති සර්ප විශේෂයක් වේ. නමුත් නේපාලයේ හා උතුරු ඉන්දියාවේ වෙසෙන ගුර්කාවරුන් නම් ජන කොටස් භාවිතා කරන විශේෂ හැඩයෙන් යුත් කුක්රි පිහියක හැඩය ඇති දත් පිහිටීම නිසා සපා කෑමකදී අධික වේදනාවකට ලක්විය හැක.',
    activeTime: 'ප්‍රධාන වශයෙන් නිසාචර සර්ප විශේෂයක් වේ.',
  ),
  Snake(
    name: 'කටකලුවා (Trinket Snake)',
    venomLevel: 'නිර්විෂ (Non-venomous)',
    imagePath: 'assets/images/snakes/trinket_snake.jpg',
    identification:
        'කටකලුවා යනු මිත්‍යාවන් රැසක් මගින් මිනිසුන් තුල කුතුහලය හා බිය ඇතිකල නිර්විෂ සර්පයෙකි. තම මුඛයේ අබ්‍යන්තර වර්ණය කළු පැහැයෙන් යුක්ත වන නිසා මෙම සර්පයා හට කටකළුවා යන නාමය ලැබී ඇත. ඉහල කඳුකරයේ හැර ශ්‍රී ලංකාවේ බොහෝ ප්‍රදේශ වල ව්‍යාප්තවී සිටින අතර මධ්‍යම ප්‍රමාණයේ සිලින්ඩරාකාර දේහය සුමට කොරල වලින් වැසී ඇත. තරමක් ගෙලින් වෙන්වූ හිස තරමක් දිගැටි ආකාරයෙන් යුක්ත වේ. පෘෂ්ඨීය වර්ණය දුඹුරු පැහැතිය. ශරීරයේ පූර්ව කොටසේ සිට මාද්‍ය දේහය දක්වා ඇති කළු පැහැ හරස් පටිවල සුදු පුල්ලි දෙක බැගින් ශරීරයේ දෙපස පිහිටයි.',
    venomEffect:
        'කිසිදු විෂක් නොමැති සර්ප විශේෂයක් වේ. ශරීරියේ ඉහළ කොටස සිග්සැග් ආකාරයට සකසාගෙන කරන අනතුරු හැඟවීමේ ආරක්‍ෂිත ඉරියව්ව හා මුඛය තුල පවතින කලු පැහැය නිසා විෂ සහිත සර්පයෙක් යැයි වරදවා වටහා ගනී.',
    activeTime:
        'ප්‍රධාන වශයෙන් නිසාචර සර්පයෙකු වුවත් දහවල් කාලයේද සුළු වශයෙන් දැකිය හැක.',
  ),
];
